// Напишите программу, которая выводит случайное трехзначное число и удаляет вторую цифру этого числа.

// 456 -> 46
// 782 -> 72
// 918 -> 98

// Напишите программу, которая принимает на вход два числа и проверяет, является ли одно число квадратом другого.

// 5, 25  ->  да
// -4, 16  ->  да
// 25, 5  ->  да
// 8,9  ->  нет

// Random rand = new Random();
// int num = rand.Next(100, 1000);
// Console.WriteLine(num);
// Console.WriteLine($"{num / 100}{num % 10}");

Console.WriteLine("ВВедите 2 числа");
int numberA = Convert.ToInt32(Console.ReadLine());
